 #Завдання1. Створіть програму, яка буде запитувати в користувача його ім'я та вік, а у відповідь повертати повідомлення — "Привіт Олег, тобі 18!".
name = input("Введіть ваше ім'я: ")
age = int(input("Введіть ваш вік: "))

print(f"Привіт {name}, тобі {age}!")

#Завдання2. Створіть програму, яка буде запитувати в користувача його вік. Якщо користувачу більше 18-ти років, тоді виводити повідомлення "Вхід дозволено!", якщо ні, тоді "Вхід заборонено!".
age = int(input("Введіть ваш вік: "))

if age > 18:
    print("Вхід дозволено!")
else:
    print("Вхід заборонено!")

#Завдання3. Створіть гру "Вгадай число".
import random

secret = random.randint(1, 10)
print("Я загадав число від 1 до 10. Спробуй вгадати!")

while True:
     guess = int(input("Твоє число: "))

     if guess < secret:
         print("Більше.")
     elif guess > secret:
         print("Менше.")
     else:
         print("Вітаю! Ти вгадав!")
         break

#Завдання4. Створіть програму, в якій користувач буде вказувати два числа — *з* і *по* яке число виводити числа. Наприклад: 5 і 10, тоді у відповідь мають вивестись всі числа від 5 до 10.
start = int(input("Введіть число 'з': "))
end = int(input("Введіть число 'по': "))

if start <= end:
    for i in range(start, end + 1):
        print(i)
else:
    for i in range(start, end - 1, -1):
        print(i)

#Завдання5. Створіть програму, яка буде виводити на екран, в рядок, тільки парні числа від 1 до n у зворотному порядку.
n = int(input("Введіть число n: "))

for i in range(n, 0, -1):
    if i % 2 == 0:
        print(i, end=" ")

#Завдання6. Створіть програму, яка буде знаходити факторіал числа !n = 1*2*3*…*n.
n = int(input("Введіть число n: "))

factorial = 1

for i in range(1, n + 1):
    factorial *= i

print(f"Факторіал числа {n} = {factorial}")

#Завдання7. Створіть програму, яка буде визначати оцінку, що отримав студент, в залежності від кількості отриманих балів на екзамені:0 - 49 — незадовільно.50 - 69 — задовільно.70 - 89 — добре.90 - 100 — відмінно.
score = int(input("Введіть кількість балів: "))

if 0 <= score <= 49:
    print("Незадовільно.")
elif 50 <= score <= 69:
    print("Задовільно.")
elif 70 <= score <= 89:
    print("Добре.")
elif 90 <= score <= 100:
    print("Відмінно.")
else:
    print("Некоректне значення.")

#Завдання8. Створіть програму калькулятор: програма повинна пропонувати по черзі ввести два числа (а, b), далі, користувачу необхідно вказати математичну дію, яку необхідно виконати з цими числами (+, -, *, /). Отриманий результат треба вивести на екран комп'ютера. Однак, якщо b=0 і вказується дія — ділення (/), то в цьому випадку програма повинна виводити підказку: «Ділення на нуль».
a = float(input("Введіть перше число (a): "))
b = float(input("Введіть друге число (b): "))
op = input("Введіть дію (+, -, *, /): ")

if op == "+":
    print("Результат:", a + b)

elif op == "-":
    print("Результат:", a - b)

elif op == "*":
    print("Результат:", a * b)

elif op == "/":
    if b == 0:
        print("Ділення на нуль")
    else:
        print("Результат:", a / b)

else:
    print("Невідома операція")

